Dlubal.RFEM5.MaterialOrthotropicPlasticModel
Material orthotropic model

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.No
Material number

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.ElasticityModulusX
Modulus of elasticity Ex

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.ElasticityModulusY
Modulus of elasticity Ey

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.ElasticityModulusZ
Modulus of elasticity Ez

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.ShearModulusYZ
Shear modulus Gyz

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.ShearModulusXZ
Shear modulus Gxz

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.ShearModulusXY
Shear modulus Gxy

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.PoissonRatioYZ
Poisson's ratio νyz

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.PoissonRatioXZ
Poisson's ratio νxz

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.PoissonRatioXY
Poisson's ratio νxy

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.HardeningModulus
Hardening modulus K

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateTensileStrengthX
Ultimate tensile strength ft,x

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateTensileStrengthY
Ultimate tensile strength ft,y

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateTensileStrengthZ
Ultimate tensile strength ft,z

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateCompressiveStrengthX
Ultimate compressive strength fc,x

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateCompressiveStrengthY
Ultimate compressive strength fc,y

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateCompressiveStrengthZ
Ultimate compressive strength fc,z

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateShearStrengthYZ
Ultimate shear strength fv,yz

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateShearStrengthXZ
Ultimate shear strength fv,xz

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.UltimateShearStrengthXY
Ultimate shear strength fv,xy

Dlubal.RFEM5.MaterialOrthotropicPlasticModel.LinearElasticOnly
Linear elastic only